#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДополнительныеРеквизитыОрганизаций(Команда)
	
	Состояние("Выполняется создание необходимых реквизитов. Это может занять некоторое время.
	|Пожалуйста, подождите...",,, БиблиотекаКартинок.ДлительнаяОперация48);
	
	Успех = СоздатьДополнительныеРеквизитыНаСервере();
	
	ТекстОповещения = ?(Успех, "Реквизиты успешно созданы!", "Реквизиты уже присутствуют в информационной базе!");
	
	ПоказатьОповещениеПользователя(ТекстОповещения,,, БиблиотекаКартинок.ЗеленаяГалка);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьДополнительныеРеквизитыНаСервере()
	
	Возврат Обработки.БанкОрг_СозданиеДопРеквизитов.СоздатьДополнительныеРеквизиты();
	
КонецФункции

#КонецОбласти
