
&Вместо("ПолучитьСведенияОбОрганизации")
Функция БанкОрг_ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения, Знач СписокПоказателей)
	// основной код
	Результат = ПродолжитьВызов(Организация, ДатаЗначения, СписокПоказателей);
	// банковские раквизиты из доп. реквизитов
	ЗначенияСвойств = УправлениеСвойствами.ЗначенияСвойств(Организация, Истина, Ложь, СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("БанкОрг_БанкСчетНомер,БанкОрг_БанкСчетНаимБанка,БанкОрг_БанкСчетКоррСчетБанка,БанкОрг_БанкСчетБИКБанка", ","));	
	Для Каждого Строка Из ЗначенияСвойств Цикл
		Результат[СтрЗаменить(Строка.ИмяСвойства, "БанкОрг_", "")] = Строка.Значение;
	КонецЦикла;

	Возврат Результат;
КонецФункции
