#Область СлужебныеПроцедурыИФункции

&Вместо("ПолучитьСведенияОбОрганизации")
Функция БанкОрг_ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения, Знач СписокПоказателей)
	// основной код
	БанкОрг_Результат = ПродолжитьВызов(Организация, ДатаЗначения, СписокПоказателей);
	// банковские раквизиты из доп. реквизитов
	БанкОрг_ЗначенияСвойств = УправлениеСвойствами.ЗначенияСвойств(Организация, Истина, Ложь, СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("БанкОрг_БанкСчетНомер,БанкОрг_БанкСчетНаимБанка,БанкОрг_БанкСчетКоррСчетБанка,БанкОрг_БанкСчетБИКБанка", ","));	
	Для Каждого Строка Из БанкОрг_ЗначенияСвойств Цикл
		БанкОрг_Результат[СтрЗаменить(Строка.ИмяСвойства, "БанкОрг_", "")] = Строка.Значение;
	КонецЦикла;

	Возврат БанкОрг_Результат;
КонецФункции

#КонецОбласти